// 서술형
// ⦁	서술형은 각 문제 아래에 서술할 것.
// ⦁	동기와 비동기 처리에 대하여 설명하라.
// 동기식 처리방법 : 서버의 요청이 두개 이상 일어나면 한개의 작업이 끝나야지 다음 작업을 수행한다.
// 비동기식 처리방법 : 서버의 요청이 두개 이상 일어나면 두개가 동시에 작업을 시작하고 끝나는 시간도  다르다.
// ⦁	싱글 스레드와 멀티 스레드에 대하여 설명하라.
// 싱글 스레드 : 컴퓨터의 작업을 하나씩만 수행한다.
// 멀티 스레드 : 컴퓨터의 작업을 여러개 동시에 수행 가능하다.
// ⦁	쿠키와 세션, 로컬저장소의 차이점에 대하여 설명하라.
// 쿠키 : 쿠키는 클라이언트에 저장되는 작은 데이터 파일이고 이름,값,만료 시간이 있다. 쿠키는 클라이언트에 저장되어 보안이 좋지 않다.
// 세션 : 사용자가 브라우저를 종료하기 전까지 클라이언트와 서버간에 연결을 유지시켜준다. ID값을 서버에 저장하고 재사용하여 보안이 쿠키보다 뛰어나다.
// 로컬저장소 : 본인이 작업하는  PC
// ⦁	콜백지옥이 무엇이고 이것을 해결하기 위한 방안은 무엇인지 설명하라.
// 콜백지옥 : 일단 콜백은 다른 함수가 실행을 끝낸뒤 실행되는 함수인데 콜백 함수안에 콜백함수가 반복되는 것을 콜백 지옥이라고 말한다.
// ⦁	Node.js 이벤트 큐 동작원리에 대하여 설명하라.
// ?????
// ⦁	GET, POST 방식에 대하여 설명하라.
// get : 서버에서 클라이언트에 데이터를 전달하고 보여주는 방식
// post :  서버에서 클라이언트에 데이터를 전달하고 그 데이터를 변경하여 서버에 넘겨주는 방식
// ⦁	자바스크립트의 배열이 실제 자료구조 배열이 아닌데 그 이유는 무엇인가?
// ?????
// ⦁	http와 https의 차이점은 무엇인가?
// http : SSL이 없다.
// https : SSL을 사용함으로서 서버에서 클라이언트에 정보를 전달할 때 암호화 시켜준다.
// ⦁	브라우저 렌더링 과정에 대하여 설명하라.
// ????
// ⦁	호이스팅이 무엇인지 서술하라.
// 함수를 먼저 선언하지 않고 함수를 먼저 실행 시키는 것.
